{"pageProps":{"aboutData":{"about":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"ВСП \"Фаховий коледж електронних приладів ІФНТУНГ\" – це сучасний заклад освіти, в якому створено всі умови для підготовки молодшого спеціаліста, що здатен витримати конкуренцію на ринку праці.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"З метою координації спільної діяльності навчальних закладів на виконання законів України про освіту, про вищу освіту, впровадження системи ступеневої підготовки фахівців для потреб регіону коледж здійснює свою діяльність в навчально-науково виробничому комплексі ІФНТУНГу, співпрацює із НУ “Львівська політехніка”, Прикарпатським університетом ім. В.Стефаника, Чернівецьким національним університетом ім. Ю. Федьковича.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"В межах комплексу розробляються складові галузевого стандарту освіти, залучаються провідні спеціалісти базових ВНЗ-ів ІІІ-ІV рівнів акредитації до роботи ДКК, випускники коледжу продовжують навчання в університетах зі споріднених спеціальностей за скороченими програмами підготовки.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Структурні підрозділи коледжу функціонують відповідно до положень, які розроблені згідно з чинним законодавством.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Склад, кваліфікація, фахова освіта викладачів та адміністративно-управлінського персоналу відповідає вимогам навчальних планів і штатному розпису.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Коледж у своїй роботі керується чинним законодавством України, наказами Міністерства освіти і науки України, статутом ІФНТУНГу, положенням про коледж   та правилами внутрішнього розпорядку, наказами ректора університету.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Зміст навчальних планів та програм, навчально-матеріальна база, якісний склад викладачів, які здійснюють фахову підготовку студентів, забезпечує регіональні потреби сучасної промисловості в молодших спеціалістах.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Навчально-лабораторна база, яка постійно розвивається, відповідає вимогам навчальних планів та програм, забезпечує сучасний рівень підготовки спеціалістів, має у своєму складі 46 навчальних кабінетів та лабораторій, 92 дисплейних місця.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Коледж має добру славу серед випускників, їхніх батьків та громадськості.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Педагогічний колектив  закладу освіти усвідомлює мету і завдання освіти в Україні на зламі століть, шукає ефективні шляхи оновлення навчального-виховного процесу і з надією дивиться у майбутнє.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Історія розвитку","nodeType":"text"}],"nodeType":"heading-4"},{"data":{},"content":[{"data":{},"marks":[],"value":"Івано-Франківський вечірній технікум електронних приладів було створено Міністерством електронної промисловості колишньої держави (наказ № 499-ДСМ від 26 серпня в 1981 році), а 1988 році наказом цього ж Міністерства № 921 від 08 грудня технікум було реорганізовано в денний Івано-Франківський технікум електронних приладів, 29 листопада 1991 року наказом Міністерства вищої освіти України № 231 технікум підпорядкований Міністерству вищої освіти України.     ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Коледж електронних приладів Івано-Франківського національного технічного університету нафти і газу створено Постановою Кабінету Міністрів України № 526 від 29 травня 1997 року та наказом Міністерства освіти України № 218 від 20.06.1997 року на базі Івано-Франківського технікуму електронних приладів, який ліквідовано.      ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Коледж електронних приладів  Івано-Франківського національного технічного університету нафти і газу прейменовано на Фаховий коледж електронних приладів Івано-Франківського національного технічного університету нафти і газу  21.10.2020 р. наказом № 232-К, відповідно до пп. 2 п. 2 розділу XIV «Прикінцевих та перехідних положень» Закону України «Про фахову передвищу освіту» та ст. 31, пп. 6 п 2 розділу XV «Прикінцевих та перехідних положень» Закону України «Про вищу освіту», Статуту ІФНТУНГ, рішення загальних зборів колективу Коледжу електронних приладів ІФНТУНГ від 19.12.2019 р., протокол №2; рішення вченої ради ІФНТУНГ від 28.12.2019 р., протокол №12/606 та наказу ректора Івано-Франківського національного технічного університету нафти і газу № 03 від 02.01.2020 р. і наказу Міністерства освіти і науки України №352 від 04.03.2020 р. ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"     ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Фаховий коледж електронних приладів ІФНТУНГ перейменовано на Відокремлений структурний підрозділ (ВСП) \"Фаховий коледж електронних приладів ІФНТУНГ\" наказ № 20-К від 10.02.2021 р.        ","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"vision":"Створення інноваційного закладу фахової передвищої освіти лідерського типу, конкуретноздатного на вітчизняному овітньому просторі. Створення атмосфери підтримки і розвитку лідерського потенціалу, творчих здібностей і талантів співробітників та стеднтів через їх участь в органах самоврядування, творчої самореалізації кожного громадянина; виховання покоління людей, здатних ефективно працювати та навчатися протягом життя, оберігати та примножувати цінності національної культури та громадянського суспільства, підготовка студентів до активного громадянства, майбутньої кар’єри, підтримка їх особистісного розвитку.","mission":"Підготовка затребуваних суспільством та ринком праці фахівців, які поєднують високі академічні, профейсійні та соціально-особистісні компентенції компетенції; забезпечення розвитку потенціалу та можливостей самореалізації студентів і співробітників в процесі їх спільної освітньої, наукової, інноваційної та організаційної діяльності.","values":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"5t1KSMrHfh4YUgNlR22FGk","type":"Entry","createdAt":"2021-07-11T22:26:21.115Z","updatedAt":"2021-07-11T22:26:21.115Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Відкритість","text":"Ми відкриті для нових ідей, змін, ми відкриті для світоглядного та міжкультурного діалогу, вільного обміну інформацією, розширення міжнародної комунікації та співпраці. Ми вільні у тому, аби будувати власне майбутнє, а досягнення поставлених цілей необхідне нам аби бути вільним."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"4SHz87Py3mzlCmtdPnH40R","type":"Entry","createdAt":"2021-07-11T22:26:59.936Z","updatedAt":"2021-07-11T22:26:59.936Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Повага до особистості","text":"Ми цінуємо та поважаємо кожну особистість, сприяємо її гармонійному розвитку, надаємо можливість для самореалізації та саморозвитку. Невід’ємною рисою сучасної людини ми визнаємо толерантність, яка приймає право іншого бути іншим, дотримуючись власних приницпів та переконань."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"6hXXIQXWr10IBHSAm4RDAN","type":"Entry","createdAt":"2021-07-11T22:27:11.800Z","updatedAt":"2021-07-11T22:27:11.800Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Креативність","text":"Ми намагаємось дати студенту не лише знання, але й необхнідні компентенції, які дозволять бути йому гнучким, креативним та глобалізованим на сучасному ринку праці. Коледж створює умови для продукування нових ідей, здійснення оригінальних, нестандартних підходів в усіх напрямках діяльності навчального закладу."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"13Us4gzPQE8YjGao0PCq6d","type":"Entry","createdAt":"2021-07-11T22:27:23.350Z","updatedAt":"2021-07-11T22:27:23.350Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Доброчесність","text":"Ми є чесними по відношенню до себе, до місця своєї праці, колег та студентів. Ми прагнемо до істини, вільного та відкритого поширення найкращих практик власної діяльності. Репутація Коледжу та його цінності для нас важливі за власні інтереси."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"5n7mYZWxUkxyTjuCKt2bBg","type":"Entry","createdAt":"2021-07-11T22:27:34.336Z","updatedAt":"2021-07-11T22:27:34.336Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Академічна свобода","text":"Ми вільні в обміні інформацією, розвитку власних ідей та визначенні власних дій при усвідомленні високої особистості відповідальності за результати. Коледж сповідує академічну свободу в обранні напрямів, форм і змісту викладдня при безумовновному дотриманні педагогічної етики та академічної доброчесності."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"5lQgJv1J9Fy8ltuIL7stSp","type":"Entry","createdAt":"2021-07-11T22:28:18.943Z","updatedAt":"2021-07-11T22:28:18.943Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Демократизм та колегіальність","text":"Коледж культивує вільне обговорення та ухвалення рішень з принципових питань діяльності Коледжу за участю органів студентського самоврядування."}},{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"kwjkl9590afm"}},"id":"1dHtl3yr6nNPtXzxEdTsDF","type":"Entry","createdAt":"2021-07-11T22:29:29.230Z","updatedAt":"2021-07-11T22:29:29.230Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"values"}},"locale":"uk-UA"},"fields":{"title":"Національна свідомість","text":"Ми є патріотами своєї держави. Ми спілкуємося та навчаємося українською мовою. Водночас ми глибоко поважаємо і цінуємо мову та культуру інших народів."}}]}},"__N_SSG":true}