{"pageProps":{"about":{"about":{"nodeType":"document","data":{},"content":[{"nodeType":"paragraph","content":[{"nodeType":"text","value":"ВСП \"Фаховий коледж електронних приладів ІФНТУНГ\" – це сучасний заклад освіти, в якому створено всі умови для підготовки молодшого спеціаліста, що здатен витримати конкуренцію на ринку праці.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"З метою координації спільної діяльності навчальних закладів на виконання законів України про освіту, про вищу освіту, впровадження системи ступеневої підготовки фахівців для потреб регіону коледж здійснює свою діяльність в навчально-науково виробничому комплексі ІФНТУНГу, співпрацює із НУ “Львівська політехніка”, Прикарпатським університетом ім. В.Стефаника, Чернівецьким національним університетом ім. Ю. Федьковича.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"В межах комплексу розробляються складові галузевого стандарту освіти, залучаються провідні спеціалісти базових ВНЗ-ів ІІІ-ІV рівнів акредитації до роботи ДКК, випускники коледжу продовжують навчання в університетах зі споріднених спеціальностей за скороченими програмами підготовки.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Структурні підрозділи коледжу функціонують відповідно до положень, які розроблені згідно з чинним законодавством.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Склад, кваліфікація, фахова освіта викладачів та адміністративно-управлінського персоналу відповідає вимогам навчальних планів і штатному розпису.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Коледж у своїй роботі керується чинним законодавством України, наказами Міністерства освіти і науки України, статутом ІФНТУНГу, положенням про коледж   та правилами внутрішнього розпорядку, наказами ректора університету.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Зміст навчальних планів та програм, навчально-матеріальна база, якісний склад викладачів, які здійснюють фахову підготовку студентів, забезпечує регіональні потреби сучасної промисловості в молодших спеціалістах.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Навчально-лабораторна база, яка постійно розвивається, відповідає вимогам навчальних планів та програм, забезпечує сучасний рівень підготовки спеціалістів, має у своєму складі 46 навчальних кабінетів та лабораторій, 92 дисплейних місця.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Коледж має добру славу серед випускників, їхніх батьків та громадськості.","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Педагогічний колектив  закладу освіти усвідомлює мету і завдання освіти в Україні на зламі століть, шукає ефективні шляхи оновлення навчального-виховного процесу і з надією дивиться у майбутнє.","marks":[],"data":{}}],"data":{}},{"nodeType":"heading-4","content":[{"nodeType":"text","value":"Історія розвитку","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Івано-Франківський вечірній технікум електронних приладів було створено Міністерством електронної промисловості колишньої держави (наказ № 499-ДСМ від 26 серпня в 1981 році), а 1988 році наказом цього ж Міністерства № 921 від 08 грудня технікум було реорганізовано в денний Івано-Франківський технікум електронних приладів, 29 листопада 1991 року наказом Міністерства вищої освіти України № 231 технікум підпорядкований Міністерству вищої освіти України.     ","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Коледж електронних приладів Івано-Франківського національного технічного університету нафти і газу створено Постановою Кабінету Міністрів України № 526 від 29 травня 1997 року та наказом Міністерства освіти України № 218 від 20.06.1997 року на базі Івано-Франківського технікуму електронних приладів, який ліквідовано.      ","marks":[],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Коледж електронних приладів  Івано-Франківського національного технічного університету нафти і газу прейменовано на Фаховий коледж електронних приладів Івано-Франківського національного технічного університету нафти і газу  21.10.2020 р. наказом № 232-К, відповідно до пп. 2 п. 2 розділу XIV «Прикінцевих та перехідних положень» Закону України «Про фахову передвищу освіту» та ст. 31, пп. 6 п 2 розділу XV «Прикінцевих та перехідних положень» Закону України «Про вищу освіту», Статуту ІФНТУНГ, рішення загальних зборів колективу Коледжу електронних приладів ІФНТУНГ від 19.12.2019 р., протокол №2; рішення вченої ради ІФНТУНГ від 28.12.2019 р., протокол №12/606 та наказу ректора Івано-Франківського національного технічного університету нафти і газу № 03 від 02.01.2020 р. і наказу Міністерства освіти і науки України №352 від 04.03.2020 р. ","marks":[],"data":{}},{"nodeType":"text","value":"     ","marks":[{"type":"bold"}],"data":{}}],"data":{}},{"nodeType":"paragraph","content":[{"nodeType":"text","value":"Фаховий коледж електронних приладів ІФНТУНГ перейменовано на Відокремлений структурний підрозділ (ВСП) \"Фаховий коледж електронних приладів ІФНТУНГ\" наказ № 20-К від 10.02.2021 р.        ","marks":[],"data":{}}],"data":{}}]}}},"__N_SSG":true}